#+TITLE: Merging Observed & ISMIP6 Freshwater Anomalies
#+AUTHOR: K. D. Mankoff

#+EMAIL:  ken.mankoff@nasa.gov
#+DATE: \tiny{ {{{time(%Y-%m-%d)}}} version:\input{|"git describe --always --dirty='*'"} } 

# version:\input{|"git describe --always --dirty='*'"}}}}}
# #+DATE: \tiny{2020-02-05} @@latex:\\@@ { \tiny version:\input{|"git describe --always --dirty='*'"}}

#+MACRO: NEWLINE @@latex:\\@@ @@html:<br>@@
#+MACRO: SKIPLINE @@latex:\\\vspace{\baselineskip}@@
#+MACRO: WARNING @@latex: {\fontencoding{U}\fontfamily{futs}\selectfont\char 66\relax}@@

#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:2 num:nil ^:{} toc:nil

#+EXCLUDE_TAGS: noexport
#+ARCHIVE: ::* Archive

#+PROPERTY: header-args :eval no-export :noweb yes
# #+PROPERTY: header-args:jupyter-python :session MC-LOB :eval no-export :noweb yes :exports results :results raw drawer
# #+PROPERTY: header-args:jupyter-python+ :var datadir="/home/kdm/projects/freshwater/freshwater/runoff/"

*** Head                                                   :BMCOL:
:PROPERTIES:
:BEAMER_col: 0.5
:END:
#+BEGIN_SRC jupyter-python :exports results
obs_GL.head(15)
#+END_SRC

#+RESULTS:
| Date                | Gt/yr |
|---------------------+-------|
| 1990-01-01 00:00:00 | 137.6 |
| 1991-01-01 00:00:00 |  76.7 |
| 1992-01-01 00:00:00 |     0 |
| 1993-01-01 00:00:00 |   3.6 |
| 1994-01-01 00:00:00 | 113.8 |
| 1995-01-01 00:00:00 | 211.9 |
| 1996-01-01 00:00:00 |     0 |
| 1997-01-01 00:00:00 |     0 |
| 1998-01-01 00:00:00 |   102 |
| 1999-01-01 00:00:00 |    47 |
| 2000-01-01 00:00:00 |  77.1 |
| 2001-01-01 00:00:00 |  26.1 |
| 2002-01-01 00:00:00 | 142.5 |
| 2003-01-01 00:00:00 | 167.2 |
| 2004-01-01 00:00:00 | 165.8 |

*** Tail                                                   :BMCOL:
:PROPERTIES:
:BEAMER_col: 0.5
:END:
#+BEGIN_SRC jupyter-python :exports results
obs_GL.tail(15)
#+END_SRC

#+RESULTS:
| Date                | Gt/yr |
|---------------------+-------|
| 2005-01-01 00:00:00 | 168.4 |
| 2006-01-01 00:00:00 | 239.8 |
| 2007-01-01 00:00:00 | 257.3 |
| 2008-01-01 00:00:00 | 201.2 |
| 2009-01-01 00:00:00 |   243 |
| 2010-01-01 00:00:00 | 376.8 |
| 2011-01-01 00:00:00 | 336.2 |
| 2012-01-01 00:00:00 | 429.3 |
| 2013-01-01 00:00:00 | 107.9 |
| 2014-01-01 00:00:00 | 184.6 |
| 2015-01-01 00:00:00 | 213.9 |
| 2016-01-01 00:00:00 |   256 |
| 2017-01-01 00:00:00 | 102.6 |
| 2018-01-01 00:00:00 |  75.8 |
| 2019-01-01 00:00:00 |   426 |



** Uncertainty

From [[citet:slater_2021][Slater (2021)]] Table 1

| Component          | Uncertainty [Gt yr^{-1}] |
|--------------------+--------------------------|
| Ice shelf calving  |                       36 |
| Ice shelf thinning |                       39 |
| Antarctic land ice |                       24 |
|--------------------+--------------------------|
| mean               |                       33 |
| sum                |                       99 |
#+TBLFM: @5$2=vmean(@2..@-1)::@6$2=vsum(@2..@4)

+ Assume these are 1 \sigma uncertainty
+ lo/mid/hi estimates can use mean (33), max (39) or sum (99)

*** If fields are random

#+BEGIN_SRC jupyter-python :exports both
from uncertainties import unumpy
import numpy as np
np.sum(unumpy.uarray([1,1,1], [36,39,24]))
#+END_SRC

#+RESULTS:
: 3.0+/-58.249463516842795

** Table

#+CAPTION: Annual Antarctic ice mass loss from ISMIP6 245
#+BEGIN_SRC jupyter-python :exports results
ismip_AQ
#+END_SRC

#+RESULTS:
| Date                |    50 |   17 |    83 |
|---------------------+-------+------+-------|
| 2020-01-01 00:00:00 |  2160 | 1440 |  3240 |
| 2030-01-01 00:00:00 |  3960 | 2520 |  5400 |
| 2040-01-01 00:00:00 |  6120 | 3600 |  8640 |
| 2050-01-01 00:00:00 |  8640 | 5040 | 12600 |
| 2060-01-01 00:00:00 | 11520 | 6120 | 16920 |
| 2070-01-01 00:00:00 | 14580 | 6120 | 22680 |
| 2080-01-01 00:00:00 | 18000 | 6480 | 29221 |
| 2090-01-01 00:00:00 | 23760 | 8640 | 38581 |
| 2100-01-01 00:00:00 | 28800 | 9720 | 50040 |

